espressif/esp-protocols/components/esp_websocket_client/examples/target/sdkconfig.ci.ds_peripheral
CONFIG_ESP_SECURE_CERT_DS_PERIPHERAL=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_OFFSET=0xC000
CONFIG_IDF_TARGET="esp32s2"
CONFIG_WEBSOCKET_URI_FROM_STRING=y
CONFIG_WEBSOCKET_URI="wss://echo.websocket.events"
CONFIG_IDF_TARGET="esp32s2"
